content/writing/writing.org
#+startup: content indent

[[file:../index.org][Giovanni's Diary]] > [[file:../subjects.org][Subjects]] >

* Writing
#+INDEX: Giovanni's Diary!Writing

I use writing as a way to clear my mind and express my ideas. Overtime,
exercising writing regularly has been one of the most beneficial things I have
done as an adult.

To re-explore creative writing, I started a series called [[file:surroundings/surroundings.org][surroundings]]
where I talk about places. Sometimes I feel creative, sometimes I want
to learn about history, some other times I like to be a guide.

I save various thoughts in my [[file:reflections/reflections.org][reflections]].

Check out my [[file:../ephemeris/ephemeris.org][journal]] and [[file:../blog.org][blog posts]]. I also write some [[file:poetry/poetry.org][poems]].

You may be interested also in my [[file:../reading/reading.org][readings]].

-----

Travel: [[file:../subjects.org][Subjects]], [[file:../theindex.org][Index]] 
