public/writing/writing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../subjects.html">Subjects</a> &gt;
</p>
<div id="outline-container-orgc9d6eab" class="outline-2">
<h2 id="orgc9d6eab">Writing</h2>
<div class="outline-text-2" id="text-orgc9d6eab">
<p>
I use writing as a way to clear my mind and express my ideas. Overtime,
exercising writing regularly has been one of the most beneficial things I have
done as an adult.
</p>

<p>
To re-explore creative writing, I started a series called <a href="surroundings/surroundings.html">surroundings</a>
where I talk about places. Sometimes I feel creative, sometimes I want
to learn about history, some other times I like to be a guide.
</p>

<p>
I save various thoughts in my <a href="reflections/reflections.html">reflections</a>.
</p>

<p>
Check out my <a href="../ephemeris/ephemeris.html">journal</a> and <a href="../blog.html">blog posts</a>. I also write some <a href="poetry/poetry.html">poems</a>.
</p>

<p>
You may be interested also in my <a href="../reading/reading.html">readings</a>.
</p>

<hr />

<p>
Travel: <a href="../subjects.html">Subjects</a>, <a href="../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
